---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotRedoFaceRoof
source: html/1e7c1c7a-5a2a-b065-bd53-0594815abb20.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotRedoFaceRoof Property

"Faces defining this Roof cannot be reacquired. Either delete the Roof or leave as it is.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRedoFaceRoof { get; }
```